HomeWork-3/reports/128M/withIndex/wrk2-R1000.txt
Running 5m test @ http://localhost:5000
  8 threads and 500 connections
  Thread calibration: mean lat.: 3447.471ms, rate sampling interval: 15769ms
  Thread calibration: mean lat.: 4235.066ms, rate sampling interval: 15581ms
  Thread calibration: mean lat.: 3052.909ms, rate sampling interval: 14221ms
  Thread calibration: mean lat.: 4225.401ms, rate sampling interval: 15589ms
  Thread calibration: mean lat.: 4289.002ms, rate sampling interval: 13754ms
  Thread calibration: mean lat.: 5981.504ms, rate sampling interval: 16498ms
  Thread calibration: mean lat.: 3620.836ms, rate sampling interval: 15720ms
  Thread calibration: mean lat.: 4811.127ms, rate sampling interval: 15671ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.26m     1.39m    4.90m    60.14%
    Req/Sec     3.58      1.30     7.00     89.86%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.11m 
 75.000%    3.44m 
 90.000%    4.31m 
 99.000%    4.78m 
 99.900%    4.87m 
 99.990%    4.91m 
 99.999%    4.91m 
100.000%    4.91m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7806.975     0.000000            1         1.00
   24739.839     0.100000          955         1.11
   54231.039     0.200000         1908         1.25
   73334.783     0.300000         2863         1.43
   98500.607     0.400000         3816         1.67
  126812.159     0.500000         4771         2.00
  143261.695     0.550000         5247         2.22
  158728.191     0.600000         5726         2.50
  176291.839     0.650000         6201         2.86
  191365.119     0.700000         6680         3.33
  206438.399     0.750000         7156         4.00
  213909.503     0.775000         7394         4.44
  221773.823     0.800000         7636         5.00
  230948.863     0.825000         7873         5.71
  240386.047     0.850000         8111         6.67
  249167.871     0.875000         8353         8.00
  252706.815     0.887500         8467         8.89
  258605.055     0.900000         8589        10.00
  263585.791     0.912500         8711        11.43
  267517.951     0.925000         8825        13.33
  271843.327     0.937500         8947        16.00
  274202.623     0.943750         9011        17.78
  275513.343     0.950000         9065        20.00
  277348.351     0.956250         9133        22.86
  279445.503     0.962500         9191        26.67
  281542.655     0.968750         9251        32.00
  282066.943     0.971875         9272        35.56
  283115.519     0.975000         9308        40.00
  283901.951     0.978125         9335        45.71
  284688.383     0.981250         9368        53.33
  285474.815     0.984375         9395        64.00
  285736.959     0.985938         9406        71.11
  286261.247     0.987500         9428        80.00
  286523.391     0.989062         9437        91.43
  287309.823     0.990625         9454       106.67
  287834.111     0.992188         9468       128.00
  288096.255     0.992969         9473       142.22
  288882.687     0.993750         9487       160.00
  289144.831     0.994531         9491       182.86
  289406.975     0.995313         9497       213.33
  289931.263     0.996094         9504       256.00
  290193.407     0.996484         9508       284.44
  290455.551     0.996875         9511       320.00
  290979.839     0.997266         9517       365.71
  291241.983     0.997656         9523       426.67
  291241.983     0.998047         9523       512.00
  291504.127     0.998242         9524       568.89
  291766.271     0.998437         9527       640.00
  291766.271     0.998633         9527       731.43
  292028.415     0.998828         9529       853.33
  292290.559     0.999023         9531      1024.00
  292552.703     0.999121         9532      1137.78
  293339.135     0.999219         9534      1280.00
  293339.135     0.999316         9534      1462.86
  293601.279     0.999414         9535      1706.67
  293863.423     0.999512         9538      2048.00
  293863.423     0.999561         9538      2275.56
  293863.423     0.999609         9538      2560.00
  293863.423     0.999658         9538      2925.71
  293863.423     0.999707         9538      3413.33
  293863.423     0.999756         9538      4096.00
  293863.423     0.999780         9538      4551.11
  294387.711     0.999805         9540      5120.00
  294387.711     1.000000         9540          inf
#[Mean    =   135872.481, StdDeviation   =    83327.421]
#[Max     =   294125.568, Total count    =         9540]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    2.17s 
 75.000%   20.48s 
 90.000%    1.00m 
 99.000%    1.00m 
 99.900%    1.00m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.015     0.000000            1         1.00
     118.143     0.100000          954         1.11
     368.639     0.200000         1908         1.25
     700.927     0.300000         2863         1.43
    1219.583     0.400000         3816         1.67
    2166.783     0.500000         4770         2.00
    3067.903     0.550000         5247         2.22
    4485.119     0.600000         5724         2.50
    7012.351     0.650000         6201         2.86
   11059.199     0.700000         6679         3.33
   20479.999     0.750000         7156         4.00
   27754.495     0.775000         7394         4.44
   35749.887     0.800000         7632         5.00
   43122.687     0.825000         7871         5.71
   49053.695     0.850000         8109         6.67
   55640.063     0.875000         8351         8.00
   58458.111     0.887500         8467         8.89
   60030.975     0.900000         9537        10.00
   60030.975     0.912500         9537        11.43
   60030.975     0.925000         9537        13.33
   60030.975     0.937500         9537        16.00
   60030.975     0.943750         9537        17.78
   60030.975     0.950000         9537        20.00
   60030.975     0.956250         9537        22.86
   60030.975     0.962500         9537        26.67
   60030.975     0.968750         9537        32.00
   60030.975     0.971875         9537        35.56
   60030.975     0.975000         9537        40.00
   60030.975     0.978125         9537        45.71
   60030.975     0.981250         9537        53.33
   60030.975     0.984375         9537        64.00
   60030.975     0.985938         9537        71.11
   60030.975     0.987500         9537        80.00
   60030.975     0.989062         9537        91.43
   60030.975     0.990625         9537       106.67
   60030.975     0.992188         9537       128.00
   60030.975     0.992969         9537       142.22
   60030.975     0.993750         9537       160.00
   60030.975     0.994531         9537       182.86
   60030.975     0.995313         9537       213.33
   60030.975     0.996094         9537       256.00
   60030.975     0.996484         9537       284.44
   60030.975     0.996875         9537       320.00
   60030.975     0.997266         9537       365.71
   60030.975     0.997656         9537       426.67
   60030.975     0.998047         9537       512.00
   60030.975     0.998242         9537       568.89
   60030.975     0.998437         9537       640.00
   60030.975     0.998633         9537       731.43
   60030.975     0.998828         9537       853.33
   60030.975     0.999023         9537      1024.00
   60030.975     0.999121         9537      1137.78
   60030.975     0.999219         9537      1280.00
   60030.975     0.999316         9537      1462.86
   60030.975     0.999414         9537      1706.67
   60030.975     0.999512         9537      2048.00
   60030.975     0.999561         9537      2275.56
   60030.975     0.999609         9537      2560.00
   60030.975     0.999658         9537      2925.71
   60096.511     0.999707         9540      3413.33
   60096.511     1.000000         9540          inf
#[Mean    =    14443.750, StdDeviation   =    21365.190]
#[Max     =    60063.744, Total count    =         9540]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10300 requests in 5.00m, 11.96MB read
  Socket errors: connect 0, read 0, write 0, timeout 24174
Requests/sec:     34.32
Transfer/sec:     40.80KB